publish/you_dont_know_date.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-25 Wed 17:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Date 的踩坑</title>
<meta name="author" content="localhost" />
<meta name="description" content="&quot;&quot;" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"
                       href="../styles/style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Date 的踩坑</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc944993">new Date() 使用 date string 返回时间格式不同</a>
<ul>
<li><a href="#org7421619">如何规避</a></li>
</ul>
</li>
<li><a href="#org80c6f61">Refs</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc944993" class="outline-2">
<h2 id="orgc944993">new Date() 使用 date string 返回时间格式不同</h2>
<div class="outline-text-2" id="text-orgc944993">
<p>
有个需求，需要计算两个日期之间包含的月份，实现如下：
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #db6e8f;">function</span> <span style="color: #88c0d0;">getMonth</span><span style="color: #6e94b9;">(</span><span style="color: #c6797e;">startDate</span>, <span style="color: #c6797e;">endDate</span><span style="color: #6e94b9;">)</span> <span style="color: #6e94b9;">{</span>
  <span style="color: #db6e8f;">const</span> <span style="color: #c6797e;">endSeconds</span> = <span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #5d80ae;">(</span>endDate<span style="color: #5d80ae;">)</span>.<span style="color: #88c0d0;">getTime</span><span style="color: #5d80ae;">()</span> / 1000
  <span style="color: #db6e8f;">const</span> <span style="color: #c6797e;">startSeconds</span> = <span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #5d80ae;">(</span>startDate<span style="color: #5d80ae;">)</span>.<span style="color: #88c0d0;">getTime</span><span style="color: #5d80ae;">()</span> / 1000
  <span style="color: #db6e8f;">const</span> <span style="color: #c6797e;">SECONDS_IN_A_MONTH</span> = 30 * 24 * 60 * 60

  <span style="color: #db6e8f;">return</span> Math.<span style="color: #88c0d0;">floor</span><span style="color: #5d80ae;">(</span><span style="color: #a3b09a;">(</span>endSeconds - startSeconds<span style="color: #a3b09a;">)</span> / SECONDS_IN_A_MONTH<span style="color: #5d80ae;">)</span>
<span style="color: #6e94b9;">}</span>

<span style="color: #88c0d0;">getMonth</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2023-03'</span>, <span style="color: #eabe9a;">'2024-03-25 01:00:00'</span><span style="color: #6e94b9;">)</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">12</span>
<span style="color: #88c0d0;">getMonth</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2023-03'</span>, <span style="color: #eabe9a;">'2024-03-25 08:00:00'</span><span style="color: #6e94b9;">)</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">13</span>
</pre>
</div>

<p>
开始日期和结束日期都相同，预期得到的月份数也是相同的，但是实际结果却相差了一个月。
</p>

<p>
观察代码发现，开始日期和结束日期传入的 date string 不一样，开始时期只包含年月，而结束日期则具体到时分秒。
</p>

<p>
是不是因为 date string 不同，导致得到的时间存在差异呢？
</p>

<p>
尝试相同的日期，不同的 date string 表示，看看结果，得到的结果确实不同，相差了 8 小时。
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2024-01-01'</span><span style="color: #6e94b9;">)</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">Mon Jan 01 2024 08:00:00 GMT+0800 (China Standard </span><span style="color: #c6797e;">Time</span><span style="color: #64727d;">)</span>
<span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2024-01-01 00:00:00'</span><span style="color: #6e94b9;">)</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">Mon Jan 01 2024 00:00:00 GMT+0800 (China Standard </span><span style="color: #c6797e;">Time</span><span style="color: #64727d;">)</span>
</pre>
</div>

<p>
查阅 Date 的文档，发现：
</p>

<blockquote>
<p>
When the time zone offset is absent, <b>date-only forms are interpreted
as a UTC time and date-time forms are interpreted as local time</b>. This
is due to a historical spec error that was not consistent with ISO
8601 but could not be changed due to web compatibility. See Broken
Parser – A Web Reality Issue.
</p>

<p>
&#x2014; <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Date#date_time_string_format">Date time string format</a>
</p>
</blockquote>

<p>
对于 <b>2024-01-01</b>
</p>

<ul class="org-ul">
<li>时分省略了，默认是 00:00:00</li>
<li>它是 <code>date-only</code> 格式，会被当作是 UTC 时间</li>
<li>它实际会被解释成 UTC 时间的 2024-01-01 00:00:00</li>
<li>new Date() 返回的是本地时间，我当前是在北京时区(+8h)，所以最后得到的是 Mon Jan 01 2024 <b>08</b>:00:00 GMT+0800 (China Standard Time)</li>
</ul>

<p>
对于 <b>2024-01-01 00:00:00</b>
</p>

<ul class="org-ul">
<li>它是 <code>date-time</code> 格式，会被当作本地时间，所以最终返回的是 Mon Jan 01 2024 <b>00</b>:00:00 GMT+0800 (China Standard Time)</li>
</ul>


<p>
通过不同的输入，可以比较一下不同 date string 的返回值：
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #64727d;">// </span><span style="color: #64727d;">&#36820;&#22238;&#26412;&#22320;&#26102;&#38388;</span>
<span style="color: #64727d;">// </span><span style="color: #64727d;">date-only forms are interpreted as a UTC time</span>
<span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2023-03'</span><span style="color: #6e94b9;">)</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">Wed Mar 01 2023 08:00:00 GMT+0800 (China Standard </span><span style="color: #c6797e;">Time</span><span style="color: #64727d;">)</span>
<span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2023-03-01'</span><span style="color: #6e94b9;">)</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">Wed Mar 01 2023 08:00:00 GMT+0800 (China Standard </span><span style="color: #c6797e;">Time</span><span style="color: #64727d;">)</span>

<span style="color: #64727d;">// </span><span style="color: #64727d;">date-time forms are interpreted as local time</span>
<span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2023-03-01T00:00:00'</span><span style="color: #6e94b9;">)</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">Wed Mar 01 2023 00:00:00 GMT+0800 (China Standard </span><span style="color: #c6797e;">Time</span><span style="color: #64727d;">)</span>
<span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2023-03-01 00:00:00'</span><span style="color: #6e94b9;">)</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">Wed Mar 01 2023 00:00:00 GMT+0800 (China Standard </span><span style="color: #c6797e;">Time</span><span style="color: #64727d;">)</span>

<span style="color: #64727d;">// </span><span style="color: #64727d;">&#36820;&#22238; UTC &#26102;&#38388;</span>
<span style="color: #64727d;">// </span><span style="color: #64727d;">date-only forms are interpreted as a UTC time</span>
<span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2023-03'</span><span style="color: #6e94b9;">)</span>.<span style="color: #88c0d0;">toUTCString</span><span style="color: #6e94b9;">()</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">'</span><span style="color: #c6797e;">Wed</span><span style="color: #64727d;">, 01 Mar 2023 00:00:00 GMT'</span>
<span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2023-03-01'</span><span style="color: #6e94b9;">)</span>.<span style="color: #88c0d0;">toUTCString</span><span style="color: #6e94b9;">()</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">'</span><span style="color: #c6797e;">Wed</span><span style="color: #64727d;">, 01 Mar 2023 00:00:00 GMT'</span>

<span style="color: #64727d;">// </span><span style="color: #64727d;">date-time forms are interpreted as local time</span>
<span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2023-03-01T00:00:00'</span><span style="color: #6e94b9;">)</span>.<span style="color: #88c0d0;">toUTCString</span><span style="color: #6e94b9;">()</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">'</span><span style="color: #c6797e;">Tue</span><span style="color: #64727d;">, 28 Feb 2023 16:00:00 GMT'</span>
<span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2023-03-01 00:00:00'</span><span style="color: #6e94b9;">)</span>.<span style="color: #88c0d0;">toUTCString</span><span style="color: #6e94b9;">()</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">'</span><span style="color: #c6797e;">Tue</span><span style="color: #64727d;">, 28 Feb 2023 16:00:00 GMT'</span>
</pre>
</div>

<p>
回到最开始的问题，代码中使用 <code>getTime()</code> 获取时间戳，getTime 获取的是 UTC 时间戳：
</p>

<blockquote>
<p>
The getTime() method of Date instances returns the number of
milliseconds for this date since the epoch, which is defined as the
midnight at the beginning of January 1, 1970, UTC.
&#x2014; <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Date/getTime">Date.prototype.getTime()</a>
</p>
</blockquote>

<p>
通过 <code>toUTCString()</code> 可以看到代码中开始时间，结束时间的返回的 UTC 时间:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2023-03'</span><span style="color: #6e94b9;">)</span>.<span style="color: #88c0d0;">toUTCString</span><span style="color: #6e94b9;">()</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">'</span><span style="color: #c6797e;">Wed</span><span style="color: #64727d;">, 01 Mar 2023 00:00:00 GMT'</span>
<span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2024-03-25 01:00:00'</span><span style="color: #6e94b9;">)</span>.<span style="color: #88c0d0;">toUTCString</span><span style="color: #6e94b9;">()</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">'</span><span style="color: #c6797e;">Sun</span><span style="color: #64727d;">, 24 Mar 2024 17:00:00 GMT'</span>
<span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span><span style="color: #eabe9a;">'2024-03-25 08:00:00'</span><span style="color: #6e94b9;">)</span>.<span style="color: #88c0d0;">toUTCString</span><span style="color: #6e94b9;">()</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">'</span><span style="color: #c6797e;">Mon</span><span style="color: #64727d;">, 25 Mar 2024 00:00:00 GMT'</span>
</pre>
</div>

<p>
可以看到，2024-03-25 01:00:00 和 2024-03-25 08:00:00 在 UTC 时间中相差了一天，就是这一天的差异，导致了计算结果的差异。
</p>
</div>

<div id="outline-container-org7421619" class="outline-3">
<h3 id="org7421619">如何规避</h3>
<div class="outline-text-3" id="text-org7421619">
<p>
由于以 date string 形式创建 Date，得到的结果可能不同，因此最好避免用 date string ，而是用参数的形式创建:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #64727d;">// </span><span style="color: #64727d;">Remember (and accept) that month is zero-indexed in JavaScript.</span>
<span style="color: #db6e8f;">new</span> <span style="color: #f7e3af;">Date</span><span style="color: #6e94b9;">(</span>2023, 02, 01<span style="color: #6e94b9;">)</span> <span style="color: #64727d;">// </span><span style="color: #64727d;">Wed Mar 01 2023 00:00:00 GMT+0800 (China Standard </span><span style="color: #c6797e;">Time</span><span style="color: #64727d;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org80c6f61" class="outline-2">
<h2 id="org80c6f61">Refs</h2>
<div class="outline-text-2" id="text-org80c6f61">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Date">Date</a></li>

<li><a href="https://css-tricks.com/everything-you-need-to-know-about-date-in-javascript/">Everything You Need to Know About Date in JavaScript</a></li>

<li><a href="https://maggiepint.com/2017/04/11/fixing-javascript-date-web-compatibility-and-reality/">Fixing JavaScript Date – Web Compatibility and Reality</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-01-08T20:54:19+08:00</p>
<p class="author">Author: localhost</p>
<p class="date">Created: 2024-09-25 Wed 17:42</p>
</div>
</body>
</html>
